DELETE FROM exam;
DELETE FROM answers;
DELETE FROM questions;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;


INSERT INTO users (name, position, department, login,  password)
VALUES ('Сергеев И.И.', 'инженер', 'секретный отдел', 'User', 'UserPassword');


INSERT INTO users (name, position, department, login,  password)
VALUES ('Антонов И.И.', 'инженер', 'секретный отдел', 'Admin', 'AdminPassword');


-- вопросы 100002 - 100010
INSERT INTO questions (body, right_answer_id  ) VALUES
  ('Земля по форме похожа на', 100012),
  ('Колобок был съеден', 100016),
  ('Дети любят', 100017),
  ('Светофор имеет цвет', 100022),
  ('Караганда это', 100023),
  ('Два умножить на два равно', 100027),
  ('Луна вращается вокруг', 100029),
  ('Дюймовочка была ростом', 100032),
  ('Яблоко это', 100037);

INSERT INTO answers (body,question_id) VALUES
  ('конус',100002),
  ('шар',100002),
  ('куб',100002),
  ('Дюймовочкой',100003),
  ('Чебурашкой',100003),
  ('лисой',100003),
  ('играть',100004),
  ('стоять в углу',100004),
  ('рыбий жир',100004),
  ('черный',100005),
  ('розовый',100005),
  ('желтый',100005),
  ('город',100006),
  ('поселок',100006),
  ('район',100006),
  ('ноль',100007),
  ('четыре',100007),
  ('десять',100007),
  ('Земли',100008),
  ('Марса',100008),
  ('Сатурна',100008),
  ('дюйм',100009),
  ('метр',100009),
  ('полтора метра',100009),
  ('овощ',100010),
  ('ягода',100010),
  ('фрукт',100010);

  INSERT INTO exam (user_id, question_id) VALUES
  (100000, 100002),
  (100000, 100003),
  (100000, 100004),
  (100000, 100005),
  (100000, 100006),
  (100000, 100007),
  (100000, 100008),
  (100000, 100009),
  (100000, 100010);

;